Revit 2027 API
BuiltInFailures.CurtainWallFailures.GridlinesOverlap Property
 Overlapping gridlines should be avoided, unless there are only two and one is host type dependent and the other is not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GridlinesOverlap { get; }
Public Shared ReadOnly Property GridlinesOverlap As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GridlinesOverlap {
	FailureDefinitionId^ get ();
}
static member GridlinesOverlap : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace